# MenuItem Class

---
An abstract base class that represent a context menu item.
SystemObject Autodesk.Revit.UIMenuItem Autodesk.Revit.UICommandMenuItem Autodesk.Revit.UISeparatorItem Autodesk.Revit.UISubMenuItem
**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 26.0.4.0 (26.0.4.0)

    public class MenuItem : IDisposable

    Public Class MenuItem
    	Implements IDisposable

    public ref class MenuItem : IDisposable

    type MenuItem =
        class
            interface IDisposable
        end
The MenuItem type exposes the following members.
| Name| Description
---|---|---
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity.
Top
| Name| Description
---|---|---
| Dispose| Releases all resources used by the MenuItem
| Equals| Determines whether the specified object is equal to the current object.(Inherited from Object)
| GetHashCode| Serves as the default hash function.(Inherited from Object)
| GetType| Gets the Type of the current instance.(Inherited from Object)
| ToString| Returns a string that represents the current object.(Inherited from Object)
Top
#### Reference
Autodesk.Revit.UI Namespace